#include <iostream>
#include<cmath>
#include<cstring>

using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");
//Вывести на экран Первую букву имени из символов "*" (звездочка)

	/*cout << " *            *" << endl;
	cout << " *  *      *  *" << endl;
	cout << " *     *      *" << endl;
	cout << " *            *" << endl;
	cout << " *            *" << endl;
	cout << " *            *" << endl;
	cout << " *            *" << endl;

//Пользователь вводит параметры фигуры. Найти периметр и площадь фигур: Квадрат
	cout << "Найти периметр и площадь фигур: Квадрат. Введите а: " << endl;

	float a, P, S;
	cin >> a ;
	P = a * 4;
	S = a * a;
	cout << "Периметр: " << P << endl;
	cout << "Площадь: " << S << endl;

	/*Пользователь вводит три числа. Найдите среднее арифметическое этих чисел, а
	также разность удвоенной суммы первого и третьего чисел и утроенного второго
	числа.
	cout << endl <<"Найти среднее арефметическое и разность. Ведите три числа:" << endl;

	float d, b, c, sr,raz, SS, SSS;
	cin >> d >> b >> c;
	sr = (d + b + c) / 3;
	SS = 2 * (d + c);
	SSS = 3 * b;
	raz= SS-SSS;
	cout << "среднее арефметическое: " << sr << endl;
	cout << "разность: " << raz << endl;

//Вычислите значение выражения: (x+1)^2+3(x+1)
		
	cout << endl << " Вычислите значение выражения: (x+1)^2+3(x+1)" << endl;
	float x, Z;
	cin >> x;
	Z = (pow(x + 1, 2)) + 3 * (x + 1);
	cout << "ответ: " << Z << endl; 
	*/

	//Сделать конвертер величин.Площадь (метры, гектар, акры)
	
	

	
}
